{
  "languages": {
    "en": "English",
    "fr": "French",
    "de": "German",
    "es": "Spanish",
    "ru": "Russian",
    "zh": "Chinese",
    "pt": "Portuguese",
    "pl": "Polish",
    "kr": "Korean",
    "jp": "Japanese",
    "custom": "Custom"
  },
  "ModFolder": "Mod(s) folder",
  "ModFolderDescription": "Select the folder where the files to translate are located. It can be the directory where all the mods are, or a specific mod folder.",
  "Mode": "Mode",
  "ModeDescription": {
    "0": "Manage how the missing translations are handled",
    "1": "Add the missing translations to the current mod folder",
    "2": "Add the missing translations to a new folder, keeping the original structure",
    "3": "Create a new mod with the missing translations (not implemented yet)"
  },
  "AddToCurrent": "Add to current",
  "ExtractToFolder": "Extract to folder",
  "CreateTranslationMod": "Create translation mod",
  "Options": "Options",
  "SourceLanguage": "Source Language",
  "TargetLanguage": "Target Language(s)",
  "subtitle": "Formerly paradox mod language converter",
  "ConvertTranslations": "Convert translations",
  "CheckFilesBeforeCreation": "Check files before creation",
  "CheckFilesBeforeCreationDesc": "Allows you to view and choose which files will be created",
  "DeepCheck": "Deep check",
  "DeepCheckDesc": "Instead of just compare existing files, check in existing files if all keys of the source language are present.",
  "DeepCheckWarn": "EXPERIMENTAL : use at your own risk, it's very slow",
  "conversionLog": {
    "starting": "Starting scanning files",
    "done": "Conversion finished"
  },
  "Close": "Close",
  "HowToUse": "How to use",
  "HowToUseDesc": {
    "1": "Select your game on the top",
    "2": "Select the directory of the mods. It can be the folder of a sigle mod, the directory of the workshop's mods or any folder containing mods",
    "3": "Select the target language(s)",
    "4": "Select the mode",
    "5": "Change the options if you need'",
    "6": "Wait for the process to finish",
    "7": "Check the files that will be created"
  },
  "HowItWorks": "How it works",
  "HowItWorksDesc": {
    "1": "To explain simply, the tool with check all the the translation files from the source language and check if there are files for the target language(s). If not, it will create them. based on the source language to avoir missing translations.",
    "2": "It help to avoid having keys instead of text if your language is not translated. It will not translate the mod by itself, only generate the localisation files.",
    "3": "If the location file is detected, even if it's incomplete, this app will not overwrite it by default. You can change this behaviour in the options.",
    "4": "In the future you will be able to check missing keys on existing files."
  },
  "Limitations": "Limitations and notes",
  "LimitationsDesc": {
    "1": "I saw multiple mods using exotic folder or file names like \"synced_localisation\" or \"replace\". The tool will ignore these folders for now.",
    "2": "This tool is mainly tested with stellaris, i've tested it with eu4 and ck3, but with fewer mods/usecase and i've not tested Hoi4, the logic is the same so there should be no problems but for some specific case it may not work. I've disabled imperator rome and victoria for now"
  }
}
