{
  "languages": {
    "en": "Englais",
    "fr": "Français",
    "de": "Allemand",
    "es": "Espagnol",
    "ru": "Russe",
    "zh": "Chinois",
    "pt": "Portugais",
    "pl": "Polonais",
    "jp": "Japonais",
    "kr": "Coréen",
    "custom": "Personnalisé"
  },
  "ModFolder": "Dossier du/des mod(s)",
  "ModFolderDescription": "Sélectionnez le dossier où se trouvent les fichiers à traduire. Il peut s'agir du répertoire où se trouvent tous les mods ou d'un dossier de mods spécifique.",
  "Mode": "Mode",
  "ModeDescription": {
    "0": "Gère la manière dont les traductions manquantes sont traitées",
    "1": "Ajoute les traductions manquantes au dossier du mod actuel",
    "2": "Ajoute les traductions manquantes à un nouveau dossier, en conservant la structure d'origine",
    "3": "Crée un nouveau mod avec les traductions manquantes (pas encore implémenté)"
  },
  "AddToCurrent": "Ajouter au mod existant",
  "ExtractToFolder": "Extraire dans un fichier",
  "CreateTranslationMod": "Créer un mod de traduction",
  "Options": "Options",
  "SourceLanguage": "Langue source",
  "TargetLanguage": "Langue(s) cible",
  "subtitle": "Anciennement paradox mod language converter",
  "ConvertTranslations": "Convertir les traductions",
  "CheckFilesBeforeCreation": "Vérifier les fichiers avant la création",
  "CheckFilesBeforeCreationDesc": "Vous permet de visualiser et choisir quels fichiers seront créés.",
  "DeepCheck": "Vérification profonde",
  "DeepCheckDesc": "Au lieu de simplement comparer les fichiers existants, vérifie dans les fichiers existants si toutes les clés de la langue source sont présentes",
  "DeepCheckWarn": "EXPERIMENTAL : utilisez-le à vos risques et périls, c'est très lent",
  "Close": "Fermer",
  "HowItWorks": "Comment ça marche",
  "HowToUse": "Comment l'utiliser",
  "Limitations": "Limitations et notes",
  "HowItWorksDesc": {
    "1": "Pour faire simple, l'outil va vérifier tous les fichiers de traduction de la langue source et vérifier s'il existe des fichiers pour la ou les langues cibles. Si ce n'est pas le cas, il va les créer en fonction de la langue source pour éviter les traductions manquantes.",
    "2": "Il permet d'éviter d'avoir des clés à la place du texte si votre langue n'est pas traduite. Le mod ne sera pas traduit en lui même, il générera uniquement les fichiers de localisation.",
    "3": "Si le fichier de localisation est détecté, même s'il est incomplet, cette application ne l'écrasera pas par défaut. Vous pouvez modifier ce comportement dans les options.",
    "4": "À l’avenir, vous pourrez vérifier les clés manquantes sur les fichiers existants."
  },
  "HowToUseDesc": {
    "1": "Sélectionnez votre jeu en haut",
    "2": "Sélectionnez le répertoire des mods. Il peut s'agir du dossier d'un mod unique, du répertoire des mods du workshop ou de tout dossier contenant des mods",
    "3": "Sélectionnez la ou les langues cibles",
    "4": "Choisissez un mode",
    "5": "Changez les options si nécessaire",
    "6": "Attendez que le processus se termine",
    "7": "Vérifiez les fichiers qui seront créés"
  },
  "LimitationsDesc": {
    "1": "J'ai vu plusieurs mods utiliser des noms de dossiers ou de fichiers exotiques comme « synced_localisation » ou « replace ». L'outil ignorera ces dossiers pour le moment.",
    "2": "Cet outil est principalement testé avec Stellaris, je l'ai testé avec Eu4 et CK3, mais avec moins de mods/cas d'utilisation et je n'ai pas testé Hoi4, la logique est la même donc il ne devrait pas y avoir de problèmes mais pour certains cas spécifiques, cela peut ne pas fonctionner. J'ai désactivé Imperator Rome et Victoria pour l'instant"
  },
  "conversionLog": {
    "done": "Conversion terminée",
    "starting": "Conversion commencée"
  }
}
